//
//  Framework.strings
//  iapd
//
//  Copyright 2006-2010 Apple Inc.. All rights reserved.
//

NOT_MADE_FOR_DEVICE_TITLE_IPHONE     = "This Accessory is Not Optimised for this iPhone";
NOT_MADE_FOR_DEVICE_TITLE_IPOD       = "This Accessory is Not Optimised for this iPod touch";
NOT_MADE_FOR_DEVICE_TITLE_IPAD       = "This Accessory is Not Optimised for this iPad";
NOT_MADE_FOR_DEVICE_MSG              = "You may experience noise caused by mobile interference and a decrease in mobile signal strength.";
NOT_MADE_FOR_DEVICE_MSG_CDMA_ONLY    = "You may experience a decrease in mobile signal strength.";

NO_RECEIVER_REQUIRED_TITLE                 = "No Receiver Required";
NO_RECEIVER_REQUIRED_MSG_FOR_DEVICE_IPHONE = "The Nike + iPod receiver is not required for this iPhone because it has a built-in receiver.";
NO_RECEIVER_REQUIRED_MSG_FOR_DEVICE_IPOD   = "The Nike + iPod receiver is not required for this iPod touch because it has a built-in receiver.";
NO_RECEIVER_REQUIRED_MSG_FOR_DEVICE_IPAD   = "The Nike + iPod receiver is not required for this iPad because it has a built-in receiver.";

TOO_MANY_ACCESSORIES_TITLE           = "Cannot Use Accessory";
TOO_MANY_ACCESSORIES_MSG             = "Only one accessory can be\nused at a time.";

FIND_APP_FOR_ACCESSORY_TITLE         = "Application Not Installed";
FIND_APP_FOR_ACCESSORY_MSG           = "This accessory requires an application you do not have installed.  Would you like to install it from the App store?";

YES_STRING                           = "Yes";
NO_STRING                            = "No";
OKAY_STRING                          = "OK";
DISMISS_STRING                       = "Dismiss";
ALLOW_STRING                         = "Allow";
IGNORE_STRING                        = "Ignore";
SETTINGS_STRING                      = "Settings";

ACCESSORY_UNSUPPORTED_BY_IPHONE      = "This Accessory is\nNot Supported by iPhone";
ACCESSORY_UNSUPPORTED_BY_IPOD        = "This Accessory is\nNot Supported by iPod touch";
ACCESSORY_UNSUPPORTED_BY_IPAD        = "This Accessory is\nNot Supported by iPad";

B82_B92_UNSUPPORTED_TITLE            = "Accessory Not Supported";
B82_B92_UNSUPPORTED_MSG              = "This accessory requires an iOS update.";

// launch title is the app name, handled programmatically
ACC_LAUNCH_APP_DESCRIPTION           = "%@ would like to communicate with the %@ %@"; // format is app name, acc manufacturer, acc name

DEMO_MODE_ACTIVATED_TITLE            = "Demo Mode Unlocked";
DEMO_MODE_ACTIVATED_MSG              = "Demo mode is now enabled\nand can be disabled in the\nSettings application.";

WIFI_CONNECTION_INFO_ASK_TITLE           = "Share Wi-Fi Settings?";
WIFI_CONNECTION_INFO_ASK_MSG             = "Do you want to share your Wi-Fi settings so this accessory can connect to the Wi-Fi network?";

WIFI_CONNECTION_INFO_UNLOCK_TITLE_IPHONE = "iPhone is Locked";
WIFI_CONNECTION_INFO_UNLOCK_TITLE_IPOD   = "iPod is Locked";
WIFI_CONNECTION_INFO_UNLOCK_TITLE_IPAD   = "iPad is Locked";
WIFI_CONNECTION_INFO_UNLOCK_MSG_IPHONE   = "This accessory would like to use the Wi-Fi network. Unlock your iPhone to configure Wi-Fi settings.";
WIFI_CONNECTION_INFO_UNLOCK_MSG_IPOD     = "This accessory would like to use the Wi-Fi network. Unlock your iPod to configure Wi-Fi settings.";
WIFI_CONNECTION_INFO_UNLOCK_MSG_IPAD     = "This accessory would like to use the Wi-Fi network. Unlock your iPad to configure Wi-Fi settings.";

WIFI_CONNECTION_INFO_NO_WIFI_TITLE       = "Connect to Wi-Fi";
WIFI_CONNECTION_INFO_NO_WIFI_MSG_IPHONE  = "This accessory would like to use a Wi-Fi network. Connect this iPhone to Wi-Fi if you want to share Wi-Fi settings with this accessory.";
WIFI_CONNECTION_INFO_NO_WIFI_MSG_IPOD    = "This accessory would like to use a Wi-Fi network. Connect this iPod to Wi-Fi if you want to share Wi-Fi settings with this accessory.";
WIFI_CONNECTION_INFO_NO_WIFI_MSG_IPAD    = "This accessory would like to use a Wi-Fi network. Connect this iPad to Wi-Fi if you want to share Wi-Fi settings with this accessory.";

WIFI_CONNECTION_INFO_UNABLE_TO_SHARE_TITLE = "Wi-Fi Settings";
WIFI_CONNECTION_INFO_UNABLE_TO_SHARE_MSG   = "This network’s settings are not available for sharing with accessories.";

INVALID_VPORT_ACCESSORY_TITLE        = "Accessory Not Supported";
INVALID_VPORT_ACCESSORY_MSG_IPHONE   = "This accessory only works when directly connected to iPhone.";
INVALID_VPORT_ACCESSORY_MSG_IPOD     = "This accessory only works when directly connected to iPod touch.";
INVALID_VPORT_ACCESSORY_MSG_IPAD     = "This accessory only works when directly connected to iPad.";

GYM_WORKOUT_COMPLETED_TITLE          = "Workout Completed";
GYM_WORKOUT_COMPLETED_MSG            = "You can send your workouts to the Nike+ website in Settings.";

ACCESSORY_LOAD_FAULT_TITLE           = "Accessory Unavailable";
ACCESSORY_LOAD_FAULT_MSG             = "The attached accessory uses too much power.";
ACCESSORY_THROUGH_VPORT_LOAD_FAULT_MSG = "The accessory attached to the dock uses too much power.";

/* IAP Strings */
IAP_UNKNOWN                          = "Unknown";
IAP_ALL                              = "All";
IAP_MOVIES                           = "Films";
IAP_TVSHOWS                          = "TV Programmes";
IAP_MUSICVIDEOS                      = "Music Videos";
IAP_VIDEOPODCASTS                    = "Video Podcasts";
IAP_SEASON                           = "Series";
IAP_RENTALS                          = "Rented Films";
IAP_UNKNOWN_GENRE                    = "Unknown genre";
IAP_UNKNOWN_COMPOSER                 = "Unknown composer";
